'''7. Напишіть функцію, яка приймає 2 списки. Результатом має бути новий список, 
в якому знаходяться елементи першого списку, яких немає в другому. 
Порядок елементів, що залишилися має відповідати порядку в першому (оригінальному) списку.
Реалізуйте обчислення за допомогою генератора в один рядок.
    Приклад:
    array_diff([1, 2], [1]) --> [2]
    array_diff([1, 2, 2, 2, 3, 4], [2]) --> [1, 3, 4]'''


def list_difference(list1, list2):
    return [el for el in list1 if el not in list2]


# must print [2]
print(list_difference([1, 2], [1]))

# must print [1, 3, 4]
print(list_difference([1, 2, 2, 2, 3, 4], [2]))
